Desker/app/controllers/desks_controller.rb

  def index
    if params[:search].present?
      @desks = Desk.near(params[:search], 5, :order => 'distance')
    else
    @desks = Desk.all
---
SELECT "desks".* FROM "desks"

  def create
    @desk = Desk.new(desk_params)

    respond_to do |format|
      if @desk.save
---
INSERT INTO "desks" ("address", "created_at", "description", "desk_type", "latitude", "longitude", "price", "thumbnail_content_type", "thumbnail_file_name", "thumbnail_file_size", "thumbnail_updated_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def set_desk
      @desk = Desk.find(params[:id])
---
SELECT desks.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.884988 - desks.latitude) * PI() / 180 / 2), 2) + COS(-33.884988 * PI() / 180) * COS(desks.latitude * PI() / 180) * POWER(SIN((151.209276 - desks.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((desks.longitude - 151.209276) / 57.2957795), ((desks.latitude - -33.884988) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "desks"  WHERE (desks.latitude BETWEEN -34.1744515662217 AND -33.5955244337783 AND desks.longitude BETWEEN 150.86059125568082 AND 151.55796074431916 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.884988 - desks.latitude) * PI() / 180 / 2), 2) + COS(-33.884988 * PI() / 180) * COS(desks.latitude * PI() / 180) * POWER(SIN((151.209276 - desks.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 20 AND desks.id != 1)  ORDER BY distance ASC