Desker/app/controllers/venues_controller.rb

SELECT "venues".* FROM "venues"
---
  def index
    @venues = Venue.all