app/controllers/desks_controller.rb

  def mylistings
    @desks = Desk.where(user: @current_user)
---
SELECT "desks".* FROM "desks"  WHERE "desks"."user_id" IS NULL

  def index
    if params[:search].present?
      @desks = Desk.near(params[:search], 5, :order => 'distance', :units => :km)

    else
    @desks = Desk.all
---
SELECT desks.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.8906466 - desks.latitude) * PI() / 180 / 2), 2) + COS(-33.8906466 * PI() / 180) * COS(desks.latitude * PI() / 180) * POWER(SIN((151.2129254 - desks.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((desks.longitude - 151.2129254) / 57.2957795), ((desks.latitude - -33.8906466) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "desks"  WHERE (desks.latitude BETWEEN -34.035378383110846 AND -33.74591481688915 AND desks.longitude BETWEEN 151.03857146257835 AND 151.38727933742163 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.8906466 - desks.latitude) * PI() / 180 / 2), 2) + COS(-33.8906466 * PI() / 180) * COS(desks.latitude * PI() / 180) * POWER(SIN((151.2129254 - desks.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 10)  ORDER BY "desks"."distance" ASC

  def show
    @desk = Desk.find(params[:id])
    @reviews = Review.where(desk_id: @desk.id).order("created_at DESC")
    if @reviews.blank?
      @avg_rating = 0
    else
      @avg_rating = @reviews.average(:rating).round(2)
---
SELECT desks.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.884988 - desks.latitude) * PI() / 180 / 2), 2) + COS(-33.884988 * PI() / 180) * COS(desks.latitude * PI() / 180) * POWER(SIN((151.209276 - desks.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((desks.longitude - 151.209276) / 57.2957795), ((desks.latitude - -33.884988) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "desks"  WHERE (desks.latitude BETWEEN -34.1744515662217 AND -33.5955244337783 AND desks.longitude BETWEEN 150.86059125568082 AND 151.55796074431916 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.884988 - desks.latitude) * PI() / 180 / 2), 2) + COS(-33.884988 * PI() / 180) * COS(desks.latitude * PI() / 180) * POWER(SIN((151.209276 - desks.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 20 AND desks.id != 1)  ORDER BY distance ASC
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."desk_id" = 21  ORDER BY created_at DESC
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."desk_id" = 12
SELECT AVG("reviews"."rating") AS avg_id FROM "reviews"  WHERE "reviews"."desk_id" = 17

  def edit
    @desk = Desk.find(params[:id])
---
SELECT  "desks".* FROM "desks"  WHERE "desks"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @desk = Desk.new(desk_params)
    @desk.user_id = @current_user.id


    respond_to do |format|
      if @desk.save
---
INSERT INTO "desks" ("address", "created_at", "description", "desk_type", "latitude", "longitude", "price", "thumbnail_content_type", "thumbnail_file_name", "thumbnail_file_size", "thumbnail_updated_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    @desk = Desk.find(params[:id])
    respond_to do |format|
      if @desk.update(desk_params)
---
SELECT  "desks".* FROM "desks"  WHERE "desks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "desks" SET "thumbnail_file_name" = $1, "thumbnail_file_size" = $2, "thumbnail_updated_at" = $3, "updated_at" = $4 WHERE "desks"."id" = 1  [["thumbnail_file_name", "sample2.jpg"], ["thumbnail_file_size", 88471], ["thumbnail_updated_at", "2014-11-23 04:21:15.880283"], ["updated_at", "2014-11-23 04:21:17.088878"]]

  def destroy
    @desk = Desk.find(params[:id])
    @desk.destroy
---
SELECT  "desks".* FROM "desks"  WHERE "desks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "desks" WHERE "desks"."id" = ?  [["id", 1]]