app/controllers/desks_controller.rb

    def set_desk
      @desk = Desk.find(params[:id])
---
SELECT "desks".* FROM "desks"  WHERE "desks"."id" IN (1, 2)