app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "rating", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "sdf"], ["created_at", "2014-11-24 04:45:26.073062"], ["rating", 4], ["updated_at", "2014-11-24 04:45:26.073062"], ["user_id", 1]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = @current_user.id
    @review.desk_id = @desk.id

    respond_to do |format|
      if @review.save

SELECT  "desks".* FROM "desks"  WHERE "desks"."id" = $1 LIMIT 1  [["id", 12]]
---
    def set_desk
      @desk = Desk.find(params[:desk_id])