app/controllers/session_controller.rb

  def create
    user = User.where(:email => params[:email]).first
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'pkjacob@gmail.com'  ORDER BY "users"."id" ASC LIMIT 1