app/controllers/users_controller.rb

  def show
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def create
    @user = User.new user_params

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = 2  [["name", "Jack"], ["password_digest", "$2a$10$lgFHAVyUYxUAOqUNG4Nqf.Rm9W1lN.uxorwSzqPOtgf1H/CJOaWOq"], ["updated_at", "2014-11-24 03:36:19.663723"]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL  ORDER BY "users"."id" ASC LIMIT 1